chirping78/lpc177x_8x/Examples/EMAC/InternetRadio/lpc177x_8x_port/decoder_0.c
/**********************************************************************
* $Id$      decoder.c     2011-06-02
*//**
* @file     decoder.c
* @brief    This example describes how to use I2S to play audio data 
*               on LPC177x_8x
* @version  1.0
* @date     02. June. 2011
* @author   NXP MCU SW Application Team
*
* Copyright(C) 2011, NXP Semiconductor
* All rights reserved.
*
***********************************************************************
* Software that is described herein is for illustrative purposes only
* which provides customers with programming information regarding the
* products. This software is supplied "AS IS" without any warranties.
* NXP Semiconductors assumes no responsibility or liability for the
* use of the software, conveys no license or title under any patent,
* copyright, or mask work right to the product. NXP Semiconductors
* reserves the right to make changes in the software without
* notification. NXP Semiconductors also make no representation or
* warranty that such application will be suitable for the specified
* use without further testing or modification.
* Permission to use, copy, modify, and distribute this software and its
* documentation is hereby granted, under NXP Semiconductors'
* relevant copyright in the software, without fee, provided that it
* is used in conjunction with NXP Semiconductors microcontrollers.  This
* copyright, permission, and disclaimer notice must appear in all copies of
* this code.
**********************************************************************/
#include <stdio.h>
#include <string.h>
#include "bsp.h"
#include "lpc177x_8x_i2s.h"
#include "lpc177x_8x_pinsel.h"
#include "lpc177x_8x_gpdma.h"
#include "lpc177x_8x_emac.h"
#include "debug_frmwrk.h"
#include "clock.h"
#include "uda1380.h"
#include "mp3dec.h"
#include "coder.h"
#if (_CURR_USING_BRD == _IAR_OLIMEX_BOARD)
#include "sdram_k4s561632j.h"
#elif (_CURR_USING_BRD == _QVGA_BOARD)
#include "sdram_mt48lc8m32lfb5.h"
#elif (_CURR_USING_BRD == _EA_PA_BOARD)
#include "sdram_is42s32800d.h"
#endif

/** @defgroup Mp3_decoder Mp3 Decoder
 * @ingroup Emac_WebRadio
 * @{
 */

/************************** PRIVATE DEFINITIONS *************************/
#define DMA_USED                1
#define TRACE_LOG               0
#define ERROR_LOG               1
#define DEBUG_DATA_READ         0
#define DEBUG_DECODE_TIME       0
#define DEBUG_DATA_WRITE        1

/** Max buffer length */
#define IN_FRAME_MIN_SIZE               (2*MAINBUF_SIZE)
#define OUT_FRAME_MAX_SIZE              (MAX_NCHAN * MAX_NGRAN * MAX_NSAMP*2)
#if DMA_USED
#define DMA_FRAME_SIZE                  (audio_frame_size)
#endif
#define DECODER_IN_BUFF_SIZE            (0x3000)
#define DECODER_OUT_BUFF_SIZE           (OUT_FRAME_MAX_SIZE)

#define DECODER_IN_BUFF_START_ADDR      (SDRAM_BASE_ADDR)
#define DECODER_OUT_BUFF_START_ADDR     (DECODER_IN_BUFF_START_ADDR + DECODER_IN_BUFF_SIZE)
#define AUDIO_BUFF_START_ADDR           (DECODER_OUT_BUFF_START_ADDR + DECODER_OUT_BUFF_SIZE)
#define AUDIO_BUFF_FRAME_NUM            (100) // it should be large enough for two decode loop.
#define AUDIO_BUFF_SIZE                 (OUT_FRAME_MAX_SIZE*AUDIO_BUFF_FRAME_NUM)
#define PLAY_BUFF_START_ADDR            (AUDIO_BUFF_START_ADDR + AUDIO_BUFF_SIZE)


/* Check buff is full or not */
#define __BUF_IS_FULL(head,tail,size)       ((head%size)== ((tail+1)%size))
/* Check buff will be full in next receiving or not */
#define __BUF_WILL_FULL(head,tail,size)     ((head%size)== ((tail+2)%size))
/* Check buff is empty */
#define __BUF_IS_EMPTY(head,tail,size)      ((head%size)==(tail%size))
/* Reset buff */
#define __BUF_RESET(bufidx)                 (bufidx=0)
#define __BUF_INCR(bufidx,size)             (bufidx=(bufidx+1)%size)
#define __BUF_DATA_NUM(head,tail,size)      ((tail>=head) ? (tail-head):(size-head+tail))
#define __BUF_FREE_DATA_NUM(head,tail,size) (size-1-__BUF_DATA_NUM(head,tail,size))                                        
#define __BUF_INCR_NUM(bufidx,num,size)     (bufidx=(bufidx+num)%size)
#define __AUDIO_BUFF_NUM(buff)              (__BUF_DATA_NUM((buff)->head,(buff)->tail,(buff)->buffer_size))
#define __AUDIO_FREE_NUM(buff)              (__BUF_FREE_DATA_NUM((buff)->head,(buff)->tail,(buff)->buffer_size))
#define __PLAY_READ_SIZE()                  (audio_frame_num*audio_frame_size)

/************************** PRIVATE VARIABLES ***********************/
typedef struct
{
    uint32_t head;
    uint32_t tail;
    uint8_t  *buffer;
    uint32_t  buffer_size;
} RING_BUFFER;

typedef RING_BUFFER       AUDIO_BUFFER;
AUDIO_BUFFER     audio_buffer;

__IO uint8_t    play_setup_stat = 0;
#if DMA_USED
__IO uint32_t   play_dma_size = 0;
#else
__IO uint32_t   play_cur_ofs;
__IO uint32_t   play_end_ofs;
#endif
__IO FlagStatus play_int_stat = RESET;

HMP3Decoder     mp3_decoder = 0;
MP3FrameInfo    mp3_frame_info; 
uint32_t        input_frame_size = 0;
uint32_t        audio_frame_size = 0;
uint32_t        audio_frame_num = 0;

#if DEBUG_DATA_READ
static clock_time_t rticks_1s;
static int64_t rsamples_cnt = -1;
#endif /*_DEBUG_FREQ*/
#if DEBUG_DATA_WRITE
static clock_time_t wticks_1s;
static int64_t wsamples_cnt = -1;
#endif
#if DEBUG_DECODE_TIME
static clock_time_t decode_ticks;
static int64_t dsamples_cnt = -1;
#endif
/************************** PRIVATE FUNCTIONS *************************/
#if DMA_USED
GPDMA_Channel_CFG_Type GPDMACfg;
void DMA_Send(void);
#else
void I2S_IRQHandler(void);
#endif
void     AudioBuf_Init(AUDIO_BUFFER *buff);
uint32_t AudioBuf_Write(AUDIO_BUFFER *buff, uint8_t* data, uint32_t size);
uint32_t AudioBuf_Read(AUDIO_BUFFER *buff, uint8_t* data, uint32_t size);
Status   Play_Setup(void);
void     Play_Control(uint8_t start);

/*********************************************************************//**
 * @brief       Initialize audio buffer
 * @param[in]   Audio Buffer
 * @return      None
 **********************************************************************/
void AudioBuf_Init(AUDIO_BUFFER *buff)
{
    __BUF_RESET(buff->head);
    __BUF_RESET(buff->tail);
    buff->buffer = (uint8_t*)AUDIO_BUFF_START_ADDR;
    buff->buffer_size = AUDIO_BUFF_SIZE;
}
/*********************************************************************//**
 * @brief       Write data to audio buffer
 * @param[in]   Audio Buffer, buffer pointer and buffer size.
 * @return      the number of written bytes.
 **********************************************************************/
uint32_t AudioBuf_Write(AUDIO_BUFFER *buff, uint8_t* data, uint32_t size)
{
    int n_wbytes = 0;   
    
        
    if(__AUDIO_FREE_NUM(buff) >= size)
    {
        memcpy(&buff->buffer[buff->tail], data, size);       
        __BUF_INCR_NUM(buff->tail,size,buff->buffer_size);
        n_wbytes = size;
#if DEBUG_DATA_WRITE        
    {
        clock_time_t cur_ticks = clock_time();
        if(wsamples_cnt == -1)
        {
            wticks_1s = cur_ticks;
            wsamples_cnt = 0;
        }
        wsamples_cnt += mp3_frame_info.outputSamps/mp3_frame_info.nChans;
        
        if((cur_ticks - wticks_1s) >= 10*CLOCK_CONF_SECOND)
        {  
            _DBG("Write ");_DBD32(((uint64_t)wsamples_cnt*CLOCK_CONF_SECOND)/(cur_ticks - wticks_1s));_DBG_(" samples in 1s.");
            wticks_1s = clock_time();
            wsamples_cnt = 0;
        }
    }
#endif /*DEBUG_DATA_WRITE*/          
    }
    else
    {
#if ERROR_LOG        
        clock_time_t cur_ticks = clock_time();
        _DBD32(cur_ticks);_DBG_(": Play so slow!!!");
#endif        
    }

