chirping78/lpc177x_8x/Examples/EMAC/InternetRadio/lpc177x_8x_port/decoder_0.c
}
/*********************************************************************//**
 * @brief		Send data to I2S through DMA
 * @param[in]	None
 * @return 		None
 **********************************************************************/
void DMA_Send(void)
{
    static volatile char in_func = 0;
    uint32_t data_num;
    
    if(in_func)
        return;
    
    in_func = 1;
    do
    {
        if(play_dma_size || (audio_frame_size == 0) || (audio_frame_num == 0))
            break;   
        
        GPDMA_ChannelCmd(0, DISABLE);
        
        data_num =  __AUDIO_BUFF_NUM(&audio_buffer);
        if(data_num < DMA_FRAME_SIZE)
        {
            Play_Control(0);
            break;
        }
       
        if(data_num >= __PLAY_READ_SIZE())
            data_num = __PLAY_READ_SIZE();
        play_dma_size = (data_num/4);
        if(play_dma_size > 0xFFF)
            play_dma_size = 0xFFF;
        AudioBuf_Read(&audio_buffer, (uint8_t*)PLAY_BUFF_START_ADDR, play_dma_size*4);
        
        
#if TRACE_LOG     
        _DBG("Send ");_DBD32(play_dma_size*4/audio_frame_size);_DBG_(" frames to I2S");
#endif
        
        // Source memory
        GPDMACfg.SrcMemAddr = PLAY_BUFF_START_ADDR;
#if ERROR_LOG    
        if(GPDMACfg.SrcMemAddr%4)
            _DBG_("Invalid DMA Source Address");
#endif    
        // Transfer size
        GPDMACfg.TransferSize = play_dma_size;
        
        GPDMA_SetupTransfer(&GPDMACfg);
           
        GPDMA_ChannelCmd(0, ENABLE);
    }while(0);
    in_func = 0;
}
#else

/*********************************************************************//**
 * @brief       I2S IRQ Handler, call to send data to transmit buffer
 * @param[in]   None
 * @return      None
 **********************************************************************/
void I2S_IRQHandler()
{
    uint32_t txlevel,i;
    uint32_t n_rbytes = 0;
    txlevel = I2S_GetLevel(LPC_I2S,I2S_TX_MODE);
    
    if(play_cur_ofs >= play_end_ofs)
    {
        uint32_t data_num = __AUDIO_BUFF_NUM(&audio_buffer);
        if(data_num > __PLAY_READ_SIZE())
            data_num = __PLAY_READ_SIZE();
        data_num = (data_num/4)*4;
        if(data_num == 0)
        {
            Play_Control(0);
            return;
        }
        AudioBuf_Read(&audio_buffer, (uint8_t*)PLAY_BUFF_START_ADDR, data_num);
        play_cur_ofs = 0;
        play_end_ofs = data_num;
    }
    for(i=0;i<8-txlevel;i++)
    {
        LPC_I2S->TXFIFO = *((uint32_t*)(PLAY_BUFF_START_ADDR + play_cur_ofs));
        play_cur_ofs+= 4;
        n_rbytes += 4;
    }
    //_DBG("Play ");_DBD16(n_rbytes);_DBG_(" bytes.");
}
#endif

/*-------------------------PUBLIC FUNCTION------------------------------*/
/*********************************************************************//**
 * @brief       Init decoder
 * @param[in]   None
 * @return      None
 **********************************************************************/
Status Decoder_Init (void) {                      

    volatile uint32_t i;

    AudioBuf_Init(&audio_buffer);

    /* Initialize I2S peripheral ------------------------------------*/
    /* Pin configuration:
     * Assign:  - P0.7 as I2STX_CLK
     *          - P0.8 as I2STX_WS
     *          - P0.9 as I2STX_SDA
     *          - P1.16 as I2SMCLK
     */
    PINSEL_ConfigPin(0,7,1);
    PINSEL_ConfigPin(0,8,1);
    PINSEL_ConfigPin(0,9,1);
    PINSEL_ConfigPin(1,16,2);
    _DBG_("[DEBUG]Init I2S interface");
    I2S_Init(LPC_I2S);
    
    _DBG_("[DEBUG]Init MP3 decoder");
    mp3_decoder = MP3InitDecoder();
    if(mp3_decoder == 0)
    {
#if ERROR_LOG        
      _DBG_("[DEBUG]Cannot init the MP3 Decoder");
#endif        
        return ERROR;
    }
    _DBG_("[DEBUG]Init SDRAM");
    SDRAMInit();
    
    return SUCCESS;
}
/*********************************************************************//**
 * @brief       Close decoder
 * @param[in]   None
 * @return      None
 **********************************************************************/
void Decoder_Close(void)
{
    MP3FreeDecoder(mp3_decoder);
    mp3_decoder = 0;
    I2S_Stop(LPC_I2S, I2S_TX_MODE);
    I2S_DeInit(LPC_I2S);
}
/*********************************************************************//**
 * @brief       Add MP3 data to input buffer
 * @param[in]   buffer address and buffer size
 * @return      None
 **********************************************************************/
void Decoder_FillInputBuffer(uint8_t* data, uint32_t size)
{
#if DEBUG_DECODE_TIME
    clock_time_t dstart_ticks = clock_time();
    clock_time_t dend_ticks;
#endif    
    if(size == 0)
        return;      
    
    // Copy frame data into input buffer
    if((input_frame_size + size) >= DECODER_IN_BUFF_SIZE)
    {
#if ERROR_LOG        
        _DBG_("Input Decoder Buffer Underflow!!!");
#endif       
        input_frame_size = DECODER_IN_BUFF_SIZE - size;
        memmove((char*)(DECODER_IN_BUFF_START_ADDR),
                (char*)(DECODER_IN_BUFF_START_ADDR + size),
                input_frame_size);
        
        memcpy((char*)(DECODER_IN_BUFF_START_ADDR + input_frame_size),
                data,
                size);
        input_frame_size += size;
        return;
    }
#if TRACE_LOG    
    if(size) {
    _DBG("Add ");_DBD32(size);
    _DBG(" bytes to buffer, frame size: ");_DBD32(input_frame_size);_DBG_("");
    }
#endif  
    if(size)
    {
        memcpy((char*)(DECODER_IN_BUFF_START_ADDR + input_frame_size),
                data,
                size);
        input_frame_size += size;
    }  
}
/*********************************************************************//**
 * @brief       Decoder data
 * @param[in]   None
 * @return      None
 **********************************************************************/
int Decoder_Decode(void)
{
    int err;
    int samples = 0;
    char exit_flag = 0;
    int sync_word = 0;
    int            decode_in_size;
    unsigned char* decode_in_buf = (unsigned char*)DECODER_IN_BUFF_START_ADDR;
    unsigned char* decode_out_buf = (unsigned char*)DECODER_OUT_BUFF_START_ADDR;   
    int frame_num = 0;
#if DEBUG_DECODE_TIME
    clock_time_t dstart_ticks = clock_time();
    clock_time_t dend_ticks;
#endif    
    if(input_frame_size == 0)
        return 0;
    
#if DEBUG_DECODE_TIME
     {
        if(dsamples_cnt == -1)
        {
            decode_ticks = 0;
            dsamples_cnt = 0;
        }
    }
#endif        
       
    while((input_frame_size >= IN_FRAME_MIN_SIZE) && (!exit_flag)) { 
        decode_in_buf = (unsigned char*)DECODER_IN_BUFF_START_ADDR;
        // Find the start of actual MP3 data
        sync_word = MP3FindSyncWord(decode_in_buf, input_frame_size);
        
        if(sync_word < 0)
        {
#if ERROR_LOG            
            _DBG_("Invalid MP3 data (No Sync Word found).");
#endif            
            input_frame_size = 0;
            return 0;
        }
        input_frame_size -= sync_word;
        decode_in_size = input_frame_size;
        decode_in_buf += sync_word;
#if TRACE_LOG        
        _DBG("Found sync word at ");_DBD32(sync_word);_DBG_("");
#endif    
        
