chirping78/lpc177x_8x/Examples/EMAC/InternetRadio/lpc177x_8x_port/decoder_0.c
        err = MP3Decode(mp3_decoder, (unsigned char**)&decode_in_buf, 
                        &decode_in_size, (short *)decode_out_buf, 0);      
        if(err)
        {
            switch(err)
            {
                case ERR_MP3_INDATA_UNDERFLOW:  
#if TRACE_LOG  
                    _DBG_("Input data underflow.");
#endif                
                case ERR_MP3_MAINDATA_UNDERFLOW:
#if TRACE_LOG                    
                    _DBG_("-->Need more MP3 data");
#endif                
                    decode_in_size = input_frame_size - sync_word;
                    decode_in_buf = (unsigned char*)(DECODER_IN_BUFF_START_ADDR + sync_word);
                    exit_flag = 1;
                    break;
                case ERR_MP3_INVALID_FRAMEHEADER:
#if ERROR_LOG                    
                    _DBG_("Invalid MP3 data (Invalid Frame header).");
#endif                
                    if(decode_in_size == (input_frame_size - sync_word))
                    {
                        decode_in_size--;
                        decode_in_buf++;
                    }
                    break;
                default:   
#if ERROR_LOG                    
                    _DBG("Decode failed! (Error code: ");_DBH(err);_DBG_(").");
#endif                
                    break;
            }
        }
        else
        {  
            // Get frame info
            MP3GetLastFrameInfo(mp3_decoder, &mp3_frame_info);	
            audio_frame_size = (mp3_frame_info.bitsPerSample / 8) * mp3_frame_info.outputSamps;                       
            AudioBuf_Write(&audio_buffer, (uint8_t*)decode_out_buf, audio_frame_size);
            samples += mp3_frame_info.outputSamps/mp3_frame_info.nChans;
            frame_num++;
            //exit_flag = 1;
        }
        if((decode_in_size > 0) && (decode_in_size != input_frame_size))
        {
            memmove((char*)DECODER_IN_BUFF_START_ADDR, 
                    (char*)decode_in_buf, 
                    decode_in_size);
            input_frame_size = decode_in_size;
         }
         else if(decode_in_size == 0)
         {
             input_frame_size = 0;
         }
   }    
#if DEBUG_DECODE_TIME 
   {
       dend_ticks = clock_time();
       dsamples_cnt += samples;
       decode_ticks += dend_ticks - dstart_ticks; 
       if(decode_ticks >= 10*CLOCK_CONF_SECOND)
        {  
            _DBG("Decode ");_DBD32(decode_ticks*1000/dsamples_cnt);_DBG_(" microseconds/sample.");
            decode_ticks = 0;
            dsamples_cnt = 0;
        }   
    }
#endif  /*DEBUG_DECODE_TIME*/

   if(frame_num > 0)
   {
#if TRACE_LOG        
       _DBD32(frame_num);_DBG_(" frames decoded.");
#endif       
       audio_frame_num = frame_num;
       Play_Control(1);
   }
   return samples;
}

/**
 * @}
 */
